// Generated by jextract

package com.davidvlijmincx.lio.generated.io.uring;

import java.lang.foreign.*;
import java.lang.invoke.VarHandle;
import java.util.function.Consumer;

import static java.lang.foreign.MemoryLayout.PathElement.groupElement;
import static java.lang.foreign.MemoryLayout.PathElement.sequenceElement;
import static java.lang.foreign.ValueLayout.OfInt;
import static java.lang.foreign.ValueLayout.OfLong;

/**
 * {@snippet lang=c :
 * struct _fpx_sw_bytes {
 *     __uint32_t magic1;
 *     __uint32_t extended_size;
 *     __uint64_t xstate_bv;
 *     __uint32_t xstate_size;
 *     __uint32_t __glibc_reserved1[7];
 * }
 * }
 */
public class _fpx_sw_bytes {

    _fpx_sw_bytes() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        liburingtest.C_INT.withName("magic1"),
        liburingtest.C_INT.withName("extended_size"),
        liburingtest.C_LONG.withName("xstate_bv"),
        liburingtest.C_INT.withName("xstate_size"),
        MemoryLayout.sequenceLayout(7, liburingtest.C_INT).withName("__glibc_reserved1")
    ).withName("_fpx_sw_bytes");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt magic1$LAYOUT = (OfInt)$LAYOUT.select(groupElement("magic1"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __uint32_t magic1
     * }
     */
    public static final OfInt magic1$layout() {
        return magic1$LAYOUT;
    }

    private static final long magic1$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __uint32_t magic1
     * }
     */
    public static final long magic1$offset() {
        return magic1$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __uint32_t magic1
     * }
     */
    public static int magic1(MemorySegment struct) {
        return struct.get(magic1$LAYOUT, magic1$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __uint32_t magic1
     * }
     */
    public static void magic1(MemorySegment struct, int fieldValue) {
        struct.set(magic1$LAYOUT, magic1$OFFSET, fieldValue);
    }

    private static final OfInt extended_size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("extended_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __uint32_t extended_size
     * }
     */
    public static final OfInt extended_size$layout() {
        return extended_size$LAYOUT;
    }

    private static final long extended_size$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __uint32_t extended_size
     * }
     */
    public static final long extended_size$offset() {
        return extended_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __uint32_t extended_size
     * }
     */
    public static int extended_size(MemorySegment struct) {
        return struct.get(extended_size$LAYOUT, extended_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __uint32_t extended_size
     * }
     */
    public static void extended_size(MemorySegment struct, int fieldValue) {
        struct.set(extended_size$LAYOUT, extended_size$OFFSET, fieldValue);
    }

    private static final OfLong xstate_bv$LAYOUT = (OfLong)$LAYOUT.select(groupElement("xstate_bv"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __uint64_t xstate_bv
     * }
     */
    public static final OfLong xstate_bv$layout() {
        return xstate_bv$LAYOUT;
    }

    private static final long xstate_bv$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __uint64_t xstate_bv
     * }
     */
    public static final long xstate_bv$offset() {
        return xstate_bv$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __uint64_t xstate_bv
     * }
     */
    public static long xstate_bv(MemorySegment struct) {
        return struct.get(xstate_bv$LAYOUT, xstate_bv$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __uint64_t xstate_bv
     * }
     */
    public static void xstate_bv(MemorySegment struct, long fieldValue) {
        struct.set(xstate_bv$LAYOUT, xstate_bv$OFFSET, fieldValue);
    }

    private static final OfInt xstate_size$LAYOUT = (OfInt)$LAYOUT.select(groupElement("xstate_size"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __uint32_t xstate_size
     * }
     */
    public static final OfInt xstate_size$layout() {
        return xstate_size$LAYOUT;
    }

    private static final long xstate_size$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __uint32_t xstate_size
     * }
     */
    public static final long xstate_size$offset() {
        return xstate_size$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __uint32_t xstate_size
     * }
     */
    public static int xstate_size(MemorySegment struct) {
        return struct.get(xstate_size$LAYOUT, xstate_size$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __uint32_t xstate_size
     * }
     */
    public static void xstate_size(MemorySegment struct, int fieldValue) {
        struct.set(xstate_size$LAYOUT, xstate_size$OFFSET, fieldValue);
    }

    private static final SequenceLayout __glibc_reserved1$LAYOUT = (SequenceLayout)$LAYOUT.select(groupElement("__glibc_reserved1"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __uint32_t __glibc_reserved1[7]
     * }
     */
    public static final SequenceLayout __glibc_reserved1$layout() {
        return __glibc_reserved1$LAYOUT;
    }

    private static final long __glibc_reserved1$OFFSET = 20;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __uint32_t __glibc_reserved1[7]
     * }
     */
    public static final long __glibc_reserved1$offset() {
        return __glibc_reserved1$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __uint32_t __glibc_reserved1[7]
     * }
     */
    public static MemorySegment __glibc_reserved1(MemorySegment struct) {
        return struct.asSlice(__glibc_reserved1$OFFSET, __glibc_reserved1$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __uint32_t __glibc_reserved1[7]
     * }
     */
    public static void __glibc_reserved1(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, __glibc_reserved1$OFFSET, __glibc_reserved1$LAYOUT.byteSize());
    }

    private static long[] __glibc_reserved1$DIMS = { 7 };

    /**
     * Dimensions for array field:
     * {@snippet lang=c :
     * __uint32_t __glibc_reserved1[7]
     * }
     */
    public static long[] __glibc_reserved1$dimensions() {
        return __glibc_reserved1$DIMS;
    }
    private static final VarHandle __glibc_reserved1$ELEM_HANDLE = __glibc_reserved1$LAYOUT.varHandle(sequenceElement());

    /**
     * Indexed getter for field:
     * {@snippet lang=c :
     * __uint32_t __glibc_reserved1[7]
     * }
     */
    public static int __glibc_reserved1(MemorySegment struct, long index0) {
        return (int)__glibc_reserved1$ELEM_HANDLE.get(struct, 0L, index0);
    }

    /**
     * Indexed setter for field:
     * {@snippet lang=c :
     * __uint32_t __glibc_reserved1[7]
     * }
     */
    public static void __glibc_reserved1(MemorySegment struct, long index0, int fieldValue) {
        __glibc_reserved1$ELEM_HANDLE.set(struct, 0L, index0, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

