// Generated by jextract

package com.davidvlijmincx.lio.generated.io.uring;

import java.lang.foreign.*;
import java.util.function.Consumer;

import static java.lang.foreign.MemoryLayout.PathElement.groupElement;
import static java.lang.foreign.ValueLayout.OfInt;
import static java.lang.foreign.ValueLayout.OfLong;

/**
 * {@snippet lang=c :
 * struct io_uring_rsrc_register {
 *     __u32 nr;
 *     __u32 flags;
 *     __u64 resv2;
 *     __u64 data;
 *     __u64 tags;
 * }
 * }
 */
public class io_uring_rsrc_register {

    io_uring_rsrc_register() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        liburingtest.C_INT.withName("nr"),
        liburingtest.C_INT.withName("flags"),
        liburingtest.C_LONG_LONG.withName("resv2"),
        liburingtest.C_LONG_LONG.withName("data"),
        liburingtest.C_LONG_LONG.withName("tags")
    ).withName("io_uring_rsrc_register");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt nr$LAYOUT = (OfInt)$LAYOUT.select(groupElement("nr"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 nr
     * }
     */
    public static final OfInt nr$layout() {
        return nr$LAYOUT;
    }

    private static final long nr$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 nr
     * }
     */
    public static final long nr$offset() {
        return nr$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 nr
     * }
     */
    public static int nr(MemorySegment struct) {
        return struct.get(nr$LAYOUT, nr$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 nr
     * }
     */
    public static void nr(MemorySegment struct, int fieldValue) {
        struct.set(nr$LAYOUT, nr$OFFSET, fieldValue);
    }

    private static final OfInt flags$LAYOUT = (OfInt)$LAYOUT.select(groupElement("flags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static final OfInt flags$layout() {
        return flags$LAYOUT;
    }

    private static final long flags$OFFSET = 4;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static final long flags$offset() {
        return flags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static int flags(MemorySegment struct) {
        return struct.get(flags$LAYOUT, flags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u32 flags
     * }
     */
    public static void flags(MemorySegment struct, int fieldValue) {
        struct.set(flags$LAYOUT, flags$OFFSET, fieldValue);
    }

    private static final OfLong resv2$LAYOUT = (OfLong)$LAYOUT.select(groupElement("resv2"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 resv2
     * }
     */
    public static final OfLong resv2$layout() {
        return resv2$LAYOUT;
    }

    private static final long resv2$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 resv2
     * }
     */
    public static final long resv2$offset() {
        return resv2$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 resv2
     * }
     */
    public static long resv2(MemorySegment struct) {
        return struct.get(resv2$LAYOUT, resv2$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 resv2
     * }
     */
    public static void resv2(MemorySegment struct, long fieldValue) {
        struct.set(resv2$LAYOUT, resv2$OFFSET, fieldValue);
    }

    private static final OfLong data$LAYOUT = (OfLong)$LAYOUT.select(groupElement("data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 data
     * }
     */
    public static final OfLong data$layout() {
        return data$LAYOUT;
    }

    private static final long data$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 data
     * }
     */
    public static final long data$offset() {
        return data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 data
     * }
     */
    public static long data(MemorySegment struct) {
        return struct.get(data$LAYOUT, data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 data
     * }
     */
    public static void data(MemorySegment struct, long fieldValue) {
        struct.set(data$LAYOUT, data$OFFSET, fieldValue);
    }

    private static final OfLong tags$LAYOUT = (OfLong)$LAYOUT.select(groupElement("tags"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * __u64 tags
     * }
     */
    public static final OfLong tags$layout() {
        return tags$LAYOUT;
    }

    private static final long tags$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * __u64 tags
     * }
     */
    public static final long tags$offset() {
        return tags$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * __u64 tags
     * }
     */
    public static long tags(MemorySegment struct) {
        return struct.get(tags$LAYOUT, tags$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * __u64 tags
     * }
     */
    public static void tags(MemorySegment struct, long fieldValue) {
        struct.set(tags$LAYOUT, tags$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

