// Generated by jextract

package com.davidvlijmincx.generated.src.org.libfuse;

import java.lang.foreign.*;
import java.util.function.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct fuse_context {
 *     struct fuse *fuse;
 *     uid_t uid;
 *     gid_t gid;
 *     pid_t pid;
 *     void *private_data;
 *     mode_t umask;
 * }
 * }
 */
public class fuse_context {

    fuse_context() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        fuse_h.C_POINTER.withName("fuse"),
        fuse_h.C_INT.withName("uid"),
        fuse_h.C_INT.withName("gid"),
        fuse_h.C_INT.withName("pid"),
        MemoryLayout.paddingLayout(4),
        fuse_h.C_POINTER.withName("private_data"),
        fuse_h.C_INT.withName("umask"),
        MemoryLayout.paddingLayout(4)
    ).withName("fuse_context");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout fuse$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("fuse"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct fuse *fuse
     * }
     */
    public static final AddressLayout fuse$layout() {
        return fuse$LAYOUT;
    }

    private static final long fuse$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct fuse *fuse
     * }
     */
    public static final long fuse$offset() {
        return fuse$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct fuse *fuse
     * }
     */
    public static MemorySegment fuse(MemorySegment struct) {
        return struct.get(fuse$LAYOUT, fuse$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct fuse *fuse
     * }
     */
    public static void fuse(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(fuse$LAYOUT, fuse$OFFSET, fieldValue);
    }

    private static final OfInt uid$LAYOUT = (OfInt)$LAYOUT.select(groupElement("uid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uid_t uid
     * }
     */
    public static final OfInt uid$layout() {
        return uid$LAYOUT;
    }

    private static final long uid$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uid_t uid
     * }
     */
    public static final long uid$offset() {
        return uid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uid_t uid
     * }
     */
    public static int uid(MemorySegment struct) {
        return struct.get(uid$LAYOUT, uid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uid_t uid
     * }
     */
    public static void uid(MemorySegment struct, int fieldValue) {
        struct.set(uid$LAYOUT, uid$OFFSET, fieldValue);
    }

    private static final OfInt gid$LAYOUT = (OfInt)$LAYOUT.select(groupElement("gid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * gid_t gid
     * }
     */
    public static final OfInt gid$layout() {
        return gid$LAYOUT;
    }

    private static final long gid$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * gid_t gid
     * }
     */
    public static final long gid$offset() {
        return gid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * gid_t gid
     * }
     */
    public static int gid(MemorySegment struct) {
        return struct.get(gid$LAYOUT, gid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * gid_t gid
     * }
     */
    public static void gid(MemorySegment struct, int fieldValue) {
        struct.set(gid$LAYOUT, gid$OFFSET, fieldValue);
    }

    private static final OfInt pid$LAYOUT = (OfInt)$LAYOUT.select(groupElement("pid"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * pid_t pid
     * }
     */
    public static final OfInt pid$layout() {
        return pid$LAYOUT;
    }

    private static final long pid$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * pid_t pid
     * }
     */
    public static final long pid$offset() {
        return pid$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * pid_t pid
     * }
     */
    public static int pid(MemorySegment struct) {
        return struct.get(pid$LAYOUT, pid$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * pid_t pid
     * }
     */
    public static void pid(MemorySegment struct, int fieldValue) {
        struct.set(pid$LAYOUT, pid$OFFSET, fieldValue);
    }

    private static final AddressLayout private_data$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("private_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *private_data
     * }
     */
    public static final AddressLayout private_data$layout() {
        return private_data$LAYOUT;
    }

    private static final long private_data$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *private_data
     * }
     */
    public static final long private_data$offset() {
        return private_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *private_data
     * }
     */
    public static MemorySegment private_data(MemorySegment struct) {
        return struct.get(private_data$LAYOUT, private_data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *private_data
     * }
     */
    public static void private_data(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(private_data$LAYOUT, private_data$OFFSET, fieldValue);
    }

    private static final OfInt umask$LAYOUT = (OfInt)$LAYOUT.select(groupElement("umask"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * mode_t umask
     * }
     */
    public static final OfInt umask$layout() {
        return umask$LAYOUT;
    }

    private static final long umask$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * mode_t umask
     * }
     */
    public static final long umask$offset() {
        return umask$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * mode_t umask
     * }
     */
    public static int umask(MemorySegment struct) {
        return struct.get(umask$LAYOUT, umask$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * mode_t umask
     * }
     */
    public static void umask(MemorySegment struct, int fieldValue) {
        struct.set(umask$LAYOUT, umask$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction} (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

